tutorials/VOF/variableTau/evenlySpacedPillars/tau0_interFoam/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water biofilm);

water
{
    transportModel  Newtonian;
    nu              1e-06;
    rho             1000;
}

biofilm
{

    // transportModel  HerschelBulkleySpatial; 
    // HerschelBulkleySpatialCoeffs
    // {
    //     nu0      [ 0 2 -1 0 0 0 0 ] 1e2;
    //     // tau0     [ 0 2 -2 0 0 0 0 ] 2e-3;
    //     k        [ 0 2 -1 0 0 0 0 ] 1e-6;
    //     n        [ 0 0 0 0 0 0 0 ] 1;
    // }       

    transportModel  HerschelBulkley; 
    HerschelBulkleyCoeffs
    {
    nu0      [ 0 2 -1 0 0 0 0 ] 1e2;
    tau0     [ 0 2 -2 0 0 0 0 ] 4e-3;
    k        [ 0 2 -1 0 0 0 0 ] 1e-6;
    n        [ 0 0 0 0 0 0 0 ] 1;
    }
    
    // transportModel  Newtonian;
    // nu              1.48e-05;

    rho             1200;
}

sigma           0.0;


// ************************************************************************* //
