tutorials/VOF/variableTau/evenlySpacedPillars/tau0_interFoam/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 1
    volScalarFieldValue tau0 0.0
);

tau0Biofilm 4e-3;

regions
(
    boxToCell
    {
        box (-2.8e-6 -5 -0.001) (0.01 5 0.001);  // Define your rectangular box

        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue tau0    $tau0Biofilm 
        );
    }
);

