tutorials/VOF/variableTau/evenlySpacedPillars/tau0_interFoam/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    cylinderCells;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (-0.000003 -0.000003 0.000000);
            p2      (-0.000003 -0.000003 1.000000);
            radius  0.000005;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (-0.000003 0.000018 0.000000);
            p2      (-0.000003 0.000018 1.000000);
            radius  0.000005;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (-0.000003 0.000037 0.000000);
            p2      (-0.000003 0.000037 1.000000);
            radius  0.000005;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000015 0.000008 0.000000);
            p2      (0.000015 0.000008 1.000000);
            radius  0.000005;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000015 0.000028 0.000000);
            p2      (0.000015 0.000028 1.000000);
            radius  0.000005;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000015 0.000048 0.000000);
            p2      (0.000015 0.000048 1.000000);
            radius  0.000005;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000032 -0.000003 0.000000);
            p2      (0.000032 -0.000003 1.000000);
            radius  0.000005;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000032 0.000018 0.000000);
            p2      (0.000032 0.000018 1.000000);
            radius  0.000005;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000032 0.000037 0.000000);
            p2      (0.000032 0.000037 1.000000);
            radius  0.000005;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000050 0.000008 0.000000);
            p2      (0.000050 0.000008 1.000000);
            radius  0.000005;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000050 0.000028 0.000000);
            p2      (0.000050 0.000028 1.000000);
            radius  0.000005;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000050 0.000048 0.000000);
            p2      (0.000050 0.000048 1.000000);
            radius  0.000005;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000067 -0.000003 0.000000);
            p2      (0.000067 -0.000003 1.000000);
            radius  0.000005;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000067 0.000018 0.000000);
            p2      (0.000067 0.000018 1.000000);
            radius  0.000005;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        sourceInfo
        {
            p1      (0.000067 0.000037 0.000000);
            p2      (0.000067 0.000037 1.000000);
            radius  0.000005;
        }
    }
    {
        name    cylinderCells;
        type    cellSet;
        action  invert;
    }
);

// ************************************************************************* //
